simulations/unorganized/test_new_mesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          300;
        startFace       549980;
    }
    outlet
    {
        type            patch;
        nFaces          300;
        startFace       550280;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1600;
        startFace       550580;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          920;
        startFace       552180;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          920;
        startFace       553100;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          552000;
        startFace       554020;
    }
)

// ************************************************************************* //
